@robotparty 
I took your code and updated it so I could run it standalone. But I was not able to reproduce the drift you mentioned

```
provider "twingate" {
  api_token = "<redacted>"
  network   = "<redacted>"
  url       = "<redacted>"
}

terraform {
  required_providers {
    twingate = {
      source = "Twingate/twingate"
    }
  }
}

variable "tg_org_name" {
  type    = string
  default = "org"
}

variable "group_ids" {
  type = map(string)
  default = {
    "dev-test" = "<redacted>"
    "dev-foo"  = "<redacted>"
    "dev-tg"   = "<redacted>"
  }
}

resource "twingate_remote_network" "test" {
  name = "${var.tg_org_name}-test"
}

resource "twingate_remote_network" "foo" {
  name = "${var.tg_org_name}-foo"
}

data "twingate_security_policies" "all" {}

data "twingate_remote_networks" "all" {
  depends_on = [twingate_remote_network.test, twingate_remote_network.foo]
}

locals {
  # unrelated stuff here...

  # Format the output of twingate_remote networks and sec pol into maps
  tg_network_map = { for network in data.twingate_remote_networks.all.remote_networks : network.name => network.id }
  tg_policy_map  = { for policy in data.twingate_security_policies.all.security_policies : policy.name => policy.id }

  tg_resource_to_env_map = {
    "foo" = {
      env              = "dev"
      resource         = "foo"
      address          = "foo-server.example.com"
      browser_shortcut = false
      is_visible       = false
      network          = "foo"
      policy           = "Default Policy"
      allow_icmp       = false
      tcp_policy       = "RESTRICTED"
      tcp_ports        = ["80"]
      udp_policy       = "RESTRICTED"
      udp_ports        = ["80"]
      group_suffix     = "foo"
    },
    "test" = {
      env              = "dev"
      resource         = "test"
      address          = "test-server.example.com"
      browser_shortcut = false
      is_visible       = false
      network          = "test"
      policy           = "Default Policy"
      allow_icmp       = false
      tcp_policy       = "RESTRICTED"
      tcp_ports        = ["80"]
      udp_policy       = "RESTRICTED"
      udp_ports        = ["80"]
      group_suffix     = "test"
    },
    "tg" = {
      env              = "dev"
      resource         = "tg"
      address          = "tg-server.example.com"
      browser_shortcut = false
      is_visible       = false
      network          = "test"
      policy           = "Default Policy"
      allow_icmp       = false
      tcp_policy       = "RESTRICTED"
      tcp_ports        = ["80"]
      udp_policy       = "RESTRICTED"
      udp_ports        = ["80"]
      group_suffix     = "test"
    }
  }
}

resource "twingate_resource" "current" {
  for_each                    = local.tg_resource_to_env_map
  name                        = "${each.value.env}-${each.value.resource}"
  alias                       = (strcontains(each.value.address, "*") == true ? null : each.value.address)
  is_browser_shortcut_enabled = each.value.browser_shortcut
  address                     = each.value.address
  is_visible                  = each.value.is_visible
  remote_network_id           = local.tg_network_map["${var.tg_org_name}-${each.value.network}"]
  security_policy_id          = local.tg_policy_map[each.value.policy]

  protocols = {
    allow_icmp = each.value.allow_icmp
    tcp = {
      policy = each.value.tcp_policy
      ports  = each.value.tcp_ports
    }
    udp = {
      policy = each.value.udp_policy
      ports  = each.value.udp_ports
    }
  }
  # access {
  #   group_ids = [lookup(var.group_ids, "${each.value.env}-${each.value.group_suffix}", null)]
  # }

  access_group {
    group_id = lookup(var.group_ids, "${each.value.env}-${each.value.group_suffix}", null)
  }
}
```

Applied

```
terraform apply
data.twingate_security_policies.all: Reading...
data.twingate_security_policies.all: Read complete after 0s [id=security-policies-all]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.twingate_remote_networks.all will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "twingate_remote_networks" "all" {
      + id              = (known after apply)
      + remote_networks = (known after apply)
    }

  # twingate_remote_network.foo will be created
  + resource "twingate_remote_network" "foo" {
      + id       = (known after apply)
      + location = "OTHER"
      + name     = "org-foo"
      + type     = "REGULAR"
    }

  # twingate_remote_network.test will be created
  + resource "twingate_remote_network" "test" {
      + id       = (known after apply)
      + location = "OTHER"
      + name     = "org-test"
      + type     = "REGULAR"
    }

  # twingate_resource.current["foo"] will be created
  + resource "twingate_resource" "current" {
      + address                     = "foo-server.example.com"
      + alias                       = "foo-server.example.com"
      + id                          = (known after apply)
      + is_active                   = true
      + is_authoritative            = (known after apply)
      + is_browser_shortcut_enabled = false
      + is_visible                  = false
      + name                        = "dev-foo"
      + protocols                   = {
          + allow_icmp = false
          + tcp        = {
              + policy = "RESTRICTED"
              + ports  = [
                  + "80",
                ]
            }
          + udp        = {
              + policy = "RESTRICTED"
              + ports  = [
                  + "80",
                ]
            }
        }
      + remote_network_id           = (known after apply)
      + security_policy_id          = "<redacted>"

      + access_group {
          + group_id = "<redacted>"
        }
    }

  # twingate_resource.current["test"] will be created
  + resource "twingate_resource" "current" {
      + address                     = "test-server.example.com"
      + alias                       = "test-server.example.com"
      + id                          = (known after apply)
      + is_active                   = true
      + is_authoritative            = (known after apply)
      + is_browser_shortcut_enabled = false
      + is_visible                  = false
      + name                        = "dev-test"
      + protocols                   = {
          + allow_icmp = false
          + tcp        = {
              + policy = "RESTRICTED"
              + ports  = [
                  + "80",
                ]
            }
          + udp        = {
              + policy = "RESTRICTED"
              + ports  = [
                  + "80",
                ]
            }
        }
      + remote_network_id           = (known after apply)
      + security_policy_id          = "<redacted>"

      + access_group {
          + group_id = "<redacted>"
        }
    }

  # twingate_resource.current["tg"] will be created
  + resource "twingate_resource" "current" {
      + address                     = "tg-server.example.com"
      + alias                       = "tg-server.example.com"
      + id                          = (known after apply)
      + is_active                   = true
      + is_authoritative            = (known after apply)
      + is_browser_shortcut_enabled = false
      + is_visible                  = false
      + name                        = "dev-tg"
      + protocols                   = {
          + allow_icmp = false
          + tcp        = {
              + policy = "RESTRICTED"
              + ports  = [
                  + "80",
                ]
            }
          + udp        = {
              + policy = "RESTRICTED"
              + ports  = [
                  + "80",
                ]
            }
        }
      + remote_network_id           = (known after apply)
      + security_policy_id          = <redacted>"

      + access_group {
          + group_id = "<redacted>"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

twingate_remote_network.foo: Creating...
twingate_remote_network.test: Creating...
twingate_remote_network.foo: Creation complete after 0s [id=<redacted>]
twingate_remote_network.test: Creation complete after 0s [id=<redacted>]
data.twingate_remote_networks.all: Reading...
data.twingate_remote_networks.all: Read complete after 0s [id=all-remote-networks]
twingate_resource.current["tg"]: Creating...
twingate_resource.current["foo"]: Creating...
twingate_resource.current["test"]: Creating...
twingate_resource.current["test"]: Creation complete after 0s [id=<redacted>]
twingate_resource.current["foo"]: Creation complete after 0s [id=<redacted>]
twingate_resource.current["tg"]: Creation complete after 0s [id=<redacted>]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.
```

Ran plan several times and there was never a drift

```
terraform plan
twingate_remote_network.foo: Refreshing state... [id=<redacted>]
twingate_remote_network.test: Refreshing state... [id=<redacted>]
data.twingate_security_policies.all: Reading...
data.twingate_security_policies.all: Read complete after 0s [id=security-policies-all]
data.twingate_remote_networks.all: Reading...
data.twingate_remote_networks.all: Read complete after 0s [id=all-remote-networks]
twingate_resource.current["tg"]: Refreshing state... [id=<redacted>]
twingate_resource.current["foo"]: Refreshing state... [id=<redacted>]
twingate_resource.current["test"]: Refreshing state... [id=<redacted>]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```